InformationRegisters/ДанныеТаблицШаблоновПриема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеТаблицШаблоновПриема</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПараметрыHTML</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТаблицаШаблонов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТаблицыШаблоновПриема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументУстановкиЗначенияПараметраПриема</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндексШаблона</Name>
					<Comment>Индекс строки шаблона приема в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьНомерСтрокиРодительскойТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторСтрокой</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРодительскойСтроки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторСтрокой</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTMLШаблон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличныйДокумент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблоныЗаполненияОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныЗаполненияОсмотра</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблоныHTML</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>омг_ВрачВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПараметрыHTML</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияЗаполненияТаблиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПараметрыHTML</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаблицаШаблонов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТаблицыШаблоновПриема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТаблицы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УправлениеОбработкамиШаблоновСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьСтруктуруСоответствий(Шаблон, ДокументОбъект = Неопределено) Экспорт
	
	массивВозврата = новый Массив;
	
	// Добавлено Макеев (
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныHTML.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ШаблоныHTML КАК ШаблоныHTML
	               |ГДЕ
	               |	ШаблоныHTML.ВидШаблона = ЗНАЧЕНИЕ(Перечисление.ВидыШаблонов.Обработка)";
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат массивВозврата;
	КонецЕсли;
	// )
	
	Для Каждого Соотнесение из Шаблон.СоответствияПараметрам Цикл
		Если ТипЗнч(Соотнесение.Параметр.ЗначениеПоУмолчанию) = Тип("СправочникСсылка.ВычисляемыеЗначенияПараметров")
			И ДокументОбъект <> Неопределено
		Тогда
			Результат = "";
			
			УстановитьБезопасныйРежим(Истина);
			Попытка
				Выполнить(Справочники.ВычисляемыеЗначенияПараметров.ПолучитьАлгоритмВычисленияЗначения(Соотнесение.Параметр.ЗначениеПоУмолчанию));
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
			УстановитьБезопасныйРежим(Ложь);
			
			Структура = Новый Структура("Таблица,Имя,Значение", Неопределено, Соотнесение.Наименование, Результат);
		Иначе
			Структура = Новый Структура("Таблица,Имя,Значение", Неопределено, Соотнесение.Наименование, Соотнесение.Параметр.ЗначениеПоУмолчанию);
		КонецЕсли;
		массивВозврата.Добавить(Структура);
	КонецЦикла;
	
	Для Каждого Соотнесение из Шаблон.СоответствияТаблицамШаблонов Цикл
		Если ТипЗнч(Соотнесение.Параметр.ЗначениеПоУмолчанию) = Тип("СправочникСсылка.ВычисляемыеЗначенияПараметров")
			И ДокументОбъект <> Неопределено
		Тогда
			Результат = "";
			
			УстановитьБезопасныйРежим(Истина);
			Попытка
				Выполнить(Справочники.ВычисляемыеЗначенияПараметров.ПолучитьАлгоритмВычисленияЗначения(Соотнесение.Параметр.ЗначениеПоУмолчанию));
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
			УстановитьБезопасныйРежим(Ложь);
			
			Структура = Новый Структура("Таблица,Имя,Значение", Соотнесение.ТаблицаОбработки, Соотнесение.Наименование, Результат);
		Иначе
			Структура = Новый Структура("Таблица,Имя,Значение", Соотнесение.ТаблицаОбработки, Соотнесение.Наименование, Соотнесение.Параметр.ЗначениеПоУмолчанию);
		КонецЕсли;
		массивВозврата.Добавить(Структура);
	КонецЦикла;
	
	Возврат массивВозврата;
	
КонецФункции

Процедура ПриСозданииВнешнейОбработки(Форма) Экспорт
	
	// ФормаГруппаШаблоныЗаполнения
	Группа = Форма.Элементы.Добавить("ФормаГруппаШаблоныЗаполнения", Тип("ГруппаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	Группа.Заголовок = "Шаблоны заполнения";
	Инд=0;
	Для Каждого ЗаполнениеСсылка из Форма.Параметры.СписокЗаполнений Цикл
		ИмяКоманды = СтрЗаменить(ЗаполнениеСсылка.УникальныйИдентификатор(),"-","_");
		Команда = Форма.Команды.Добавить("Ссылка"+ИмяКоманды);
		Команда.Действие = "Выбор";
		НоваяКнопка = Форма.Элементы.Добавить("НоваяКнопка"+Инд, Тип("КнопкаФормы"), Группа);
		НоваяКнопка.ИмяКоманды = "Ссылка"+ ИмяКоманды;
		НоваяКнопка.Заголовок = ЗаполнениеСсылка.Наименование;
		Инд = Инд + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьМассивЗаполнений(ШаблонОсмотра) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШаблоныЗаполненияОсмотра.Ссылка
		|ИЗ
		|	Справочник.ШаблоныЗаполненияОсмотра КАК ШаблоныЗаполненияОсмотра
		|ГДЕ
		|	ШаблоныЗаполненияОсмотра.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", ШаблонОсмотра);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ОбработатьПоУИШаблонЗаполнения(СтрокаУИ) Экспорт
	
	Ссылка = Справочники.ШаблоныЗаполненияОсмотра.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаУИ));
	
	МассивПараметров = Новый Массив;
	Для Каждого ЗначениеЗаполнения из Ссылка.ЗначенияЗаполнения Цикл
		Структура = Новый Структура("Параметр,Значение",ЗначениеЗаполнения.Параметр,ЗначениеЗаполнения.Значение);
		Структура.Вставить("Имя",Ссылка.Владелец.СоответствияПараметрам.Найти(ЗначениеЗаполнения.Параметр).Наименование);
		МассивПараметров.Добавить(Структура);
	КонецЦикла;
	
	МассивПараметровТаблиц = Новый Массив;
	Для Каждого ЗначениеЗаполнения из Ссылка.ЗначенияЗаполненияТаблиц Цикл
		СоответствияТаблицамШаблонов = Ссылка.Владелец.СоответствияТаблицамШаблонов;
		Для Каждого Строка Из СоответствияТаблицамШаблонов Цикл
			Если Строка.Параметр = ЗначениеЗаполнения.Параметр
				И Строка.ТаблицаШаблонов = ЗначениеЗаполнения.ТаблицаШаблонов
			Тогда
				Структура = Новый Структура("Параметр,Значение,ТаблицаШаблонов,НомерСтрокиТаблицы",ЗначениеЗаполнения.Параметр,ЗначениеЗаполнения.Значение,ЗначениеЗаполнения.ТаблицаШаблонов,ЗначениеЗаполнения.НомерСтрокиТаблицы);
				Структура.Вставить("Имя", Строка.Представление);
				Структура.Вставить("ТаблицаОбработки", Строка.ТаблицаОбработки);
				МассивПараметровТаблиц.Добавить(Структура);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Новый Структура("МассивПараметров, МассивПараметровТаблиц", МассивПараметров, МассивПараметровТаблиц);
	
КонецФункции

Функция СформироватьЗначенияПредыдущегоОсмотра(МедКарта, ЗаполняемыйПрием, ВыбранныеПараметры = Неопределено, ТолькоПараметрыЗаполняемыеПредыдущими = Ложь) Экспорт
	
	Возврат РаботаСШаблонамиHTML.СформироватьЗначенияПредыдущегоОсмотра(МедКарта, ЗаполняемыйПрием, ВыбранныеПараметры, ТолькоПараметрыЗаполняемыеПредыдущими);
	
КонецФункции

Функция СформироватьЗначенияТаблицПредыдущегоОсмотра(МедКарта, ЗаполняемыйПрием, ВыбранныеПараметры = Неопределено, ТолькоПараметрыЗаполняемыеПредыдущими = Ложь, МассивТаблиц = Неопределено, Шаблон = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеТаблицШаблоновПриема.Параметр КАК Параметр,
		|	Прием.Дата КАК ДокументДата,
		|	ДанныеТаблицШаблоновПриема.Документ КАК Документ,
		|	Прием.МедицинскаяКарта КАК МедицинскаяКарта,
		|	ДанныеТаблицШаблоновПриема.ИндексШаблона КАК ИндексШаблона,
		|	ДанныеТаблицШаблоновПриема.Значение КАК Значение,
		|	ДанныеТаблицШаблоновПриема.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ДанныеТаблицШаблоновПриема.ТаблицаШаблонов КАК ТаблицаШаблонов
		|ПОМЕСТИТЬ ЗаписиРСБезОтбора
		|ИЗ
		|	РегистрСведений.ДанныеТаблицШаблоновПриема КАК ДанныеТаблицШаблоновПриема
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Прием КАК Прием
		|		ПО (Прием.Клиент = &Клиент)
		|			И ДанныеТаблицШаблоновПриема.Документ = Прием.Ссылка
		|			И (Прием.Проведен)
		|			И (Прием.Ссылка <> &Прием)
		|ГДЕ
		|	(&Параметр ЕСТЬ NULL
		|			ИЛИ ДанныеТаблицШаблоновПриема.Параметр В (&Параметр))
		|	И (&Таблицы ЕСТЬ NULL
		|			ИЛИ ДанныеТаблицШаблоновПриема.ТаблицаШаблонов В (&Таблицы))
		|	И НЕ(&ТолькоПараметрыЗаполняемыеПредыдущими
		|				И ДанныеТаблицШаблоновПриема.Параметр.НеЗаполняетсяПредыдущимиЗначениями)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаписиРСБезОтбора.Параметр КАК Параметр,
		|	МАКСИМУМ(ЗаписиРСБезОтбора.ДокументДата) КАК ДокументДата,
		|	ЗаписиРСБезОтбора.ТаблицаШаблонов КАК ТаблицаШаблонов,
		|	ЗаписиРСБезОтбора.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы
		|ПОМЕСТИТЬ ЗаписиСОтбором
		|ИЗ
		|	ЗаписиРСБезОтбора КАК ЗаписиРСБезОтбора
		|ГДЕ
		|	ЗаписиРСБезОтбора.МедицинскаяКарта = &МедицинскаяКарта
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаписиРСБезОтбора.Параметр,
		|	ЗаписиРСБезОтбора.ТаблицаШаблонов,
		|	ЗаписиРСБезОтбора.НомерСтрокиТаблицы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаписиРСБезОтбора.Параметр КАК Параметр,
		|	МАКСИМУМ(ЗаписиРСБезОтбора.ДокументДата) КАК Дата,
		|	ЗаписиРСБезОтбора.ТаблицаШаблонов КАК ТаблицаШаблонов,
		|	ЗаписиРСБезОтбора.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы
		|ПОМЕСТИТЬ ЗаписиБезОтбора
		|ИЗ
		|	ЗаписиРСБезОтбора КАК ЗаписиРСБезОтбора
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаписиРСБезОтбора.Параметр,
		|	ЗаписиРСБезОтбора.ТаблицаШаблонов,
		|	ЗаписиРСБезОтбора.НомерСтрокиТаблицы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СОтбором.Параметр ЕСТЬ NULL
		|			ТОГДА БезОтбора.Параметр
		|		ИНАЧЕ СОтбором.Параметр
		|	КОНЕЦ КАК Параметр,
		|	ВЫБОР
		|		КОГДА СОтбором.Параметр ЕСТЬ NULL
		|			ТОГДА БезОтбора.ДокументДата
		|		ИНАЧЕ СОтбором.ДокументДата
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА СОтбором.Параметр ЕСТЬ NULL
		|			ТОГДА БезОтбора.ТаблицаШаблонов
		|		ИНАЧЕ СОтбором.ТаблицаШаблонов
		|	КОНЕЦ КАК ТаблицаШаблонов,
		|	ВЫБОР
		|		КОГДА СОтбором.Параметр ЕСТЬ NULL
		|			ТОГДА БезОтбора.НомерСтрокиТаблицы
		|		ИНАЧЕ СОтбором.НомерСтрокиТаблицы
		|	КОНЕЦ КАК НомерСтрокиТаблицы
		|ПОМЕСТИТЬ МаксимумыДокументы
		|ИЗ
		|	ЗаписиСОтбором КАК СОтбором
		|		ПОЛНОЕ СОЕДИНЕНИЕ ЗаписиРСБезОтбора КАК БезОтбора
		|		ПО СОтбором.Параметр = БезОтбора.Параметр
		|			И СОтбором.ТаблицаШаблонов = БезОтбора.ТаблицаШаблонов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриемШаблоныПриема.Ссылка КАК Ссылка,
		|	ПриемШаблоныПриема.НомерСтроки КАК НомерСтроки,
		|	ПриемШаблоныПриема.ШаблонПриема КАК ШаблонПриема
		|ПОМЕСТИТЬ ШаблоныПриемов
		|ИЗ
		|	Документ.Прием.ШаблоныПриема КАК ПриемШаблоныПриема
		|ГДЕ
		|	ПриемШаблоныПриема.Ссылка В
		|			(ВЫБРАТЬ
		|				ЗаписиРСБезОтбора.Документ
		|			ИЗ
		|				ЗаписиРСБезОтбора)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметровHTML.Параметр КАК Параметр,
		|	ЗначенияПараметровHTML.Значение КАК Значение,
		|	ПриемШаблоныПриема.ШаблонПриема КАК ШаблонПриема,
		|	ЗначенияПараметровHTML.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ЗначенияПараметровHTML.ТаблицаШаблонов КАК ТаблицаШаблонов
		|ПОМЕСТИТЬ ПараметрыТаблицШаблонов
		|ИЗ
		|	МаксимумыДокументы КАК МаксимумыДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаписиРСБезОтбора КАК ЗначенияПараметровHTML
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШаблоныПриемов КАК ПриемШаблоныПриема
		|			ПО ЗначенияПараметровHTML.Документ = ПриемШаблоныПриема.Ссылка
		|				И (ЗначенияПараметровHTML.ИндексШаблона = ПриемШаблоныПриема.НомерСтроки - 1)
		|		ПО МаксимумыДокументы.Параметр = ЗначенияПараметровHTML.Параметр
		|			И МаксимумыДокументы.Дата = ЗначенияПараметровHTML.ДокументДата
		|			И МаксимумыДокументы.ТаблицаШаблонов = ЗначенияПараметровHTML.ТаблицаШаблонов
		|			И МаксимумыДокументы.НомерСтрокиТаблицы = ЗначенияПараметровHTML.НомерСтрокиТаблицы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыТаблицШаблонов.Параметр КАК Параметр,
		|	ПараметрыТаблицШаблонов.Значение КАК Значение,
		|	ПараметрыТаблицШаблонов.ШаблонПриема КАК ШаблонПриема,
		|	ПараметрыТаблицШаблонов.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ПараметрыТаблицШаблонов.ТаблицаШаблонов КАК ТаблицаШаблонов
		|ПОМЕСТИТЬ ПараметрыШаблона
		|ИЗ
		|	ПараметрыТаблицШаблонов КАК ПараметрыТаблицШаблонов
		|ГДЕ
		|	(&Шаблон ЕСТЬ NULL
		|			ИЛИ ПараметрыТаблицШаблонов.ШаблонПриема = &Шаблон)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыТаблицШаблонов.Параметр КАК Параметр,
		|	ПараметрыТаблицШаблонов.Значение КАК Значение,
		|	ПараметрыТаблицШаблонов.ШаблонПриема КАК ШаблонПриема,
		|	ПараметрыТаблицШаблонов.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ПараметрыТаблицШаблонов.ТаблицаШаблонов КАК ТаблицаШаблонов
		|ПОМЕСТИТЬ ПараметрыНеИзШаблона
		|ИЗ
		|	ПараметрыТаблицШаблонов КАК ПараметрыТаблицШаблонов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыШаблона КАК ПараметрыШаблона
		|		ПО ПараметрыТаблицШаблонов.Параметр = ПараметрыШаблона.Параметр
		|			И ПараметрыТаблицШаблонов.Значение = ПараметрыШаблона.Значение
		|			И ПараметрыТаблицШаблонов.ШаблонПриема = ПараметрыШаблона.ШаблонПриема
		|			И ПараметрыТаблицШаблонов.НомерСтрокиТаблицы = ПараметрыШаблона.НомерСтрокиТаблицы
		|			И ПараметрыТаблицШаблонов.ТаблицаШаблонов = ПараметрыШаблона.ТаблицаШаблонов
		|ГДЕ
		|	ПараметрыШаблона.ШаблонПриема В (НЕОПРЕДЕЛЕНО, NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПараметрыШаблона.ШаблонПриема ЕСТЬ NULL
		|			ТОГДА ПараметрыНеИзШаблона.Параметр
		|		ИНАЧЕ ПараметрыШаблона.Параметр
		|	КОНЕЦ КАК Параметр,
		|	ВЫБОР
		|		КОГДА ПараметрыШаблона.ШаблонПриема ЕСТЬ NULL
		|			ТОГДА ПараметрыНеИзШаблона.Значение
		|		ИНАЧЕ ПараметрыШаблона.Значение
		|	КОНЕЦ КАК Значение,
		|	ВЫБОР
		|		КОГДА ПараметрыШаблона.ШаблонПриема ЕСТЬ NULL
		|			ТОГДА ПараметрыНеИзШаблона.ШаблонПриема
		|		ИНАЧЕ ПараметрыШаблона.ШаблонПриема
		|	КОНЕЦ КАК ШаблонПриема,
		|	ВЫБОР
		|		КОГДА ПараметрыШаблона.ШаблонПриема ЕСТЬ NULL
		|			ТОГДА ПараметрыНеИзШаблона.НомерСтрокиТаблицы
		|		ИНАЧЕ ПараметрыШаблона.НомерСтрокиТаблицы
		|	КОНЕЦ КАК НомерСтрокиТаблицы,
		|	ВЫБОР
		|		КОГДА ПараметрыШаблона.ШаблонПриема ЕСТЬ NULL
		|			ТОГДА ПараметрыНеИзШаблона.ТаблицаШаблонов
		|		ИНАЧЕ ПараметрыШаблона.ТаблицаШаблонов
		|	КОНЕЦ КАК ТаблицаШаблонов
		|ПОМЕСТИТЬ ПараметрыШаблонов
		|ИЗ
		|	ПараметрыШаблона КАК ПараметрыШаблона
		|		ПОЛНОЕ СОЕДИНЕНИЕ ПараметрыНеИзШаблона КАК ПараметрыНеИзШаблона
		|		ПО ПараметрыШаблона.Параметр = ПараметрыНеИзШаблона.Параметр
		|			И ПараметрыШаблона.ТаблицаШаблонов = ПараметрыНеИзШаблона.ТаблицаШаблонов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПараметрыШаблонов.Параметр КАК Параметр,
		|	ПараметрыШаблонов.Значение КАК Значение,
		|	ПараметрыШаблонов.ШаблонПриема КАК ШаблонПриема,
		|	ПараметрыШаблонов.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	ПараметрыШаблонов.ТаблицаШаблонов КАК ТаблицаШаблонов
		|ИЗ
		|	ПараметрыШаблонов КАК ПараметрыШаблонов";
	
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедКарта);
	Запрос.УстановитьПараметр("Клиент", МедКарта.Клиент);
	Запрос.УстановитьПараметр("ТолькоПараметрыЗаполняемыеПредыдущими", ТолькоПараметрыЗаполняемыеПредыдущими);
	Запрос.УстановитьПараметр("Прием", ЗаполняемыйПрием);
	
	
	Если ЗначениеЗаполнено(ВыбранныеПараметры) Тогда
		Запрос.УстановитьПараметр("Параметр",ВыбранныеПараметры);
	Иначе
		Запрос.УстановитьПараметр("Параметр",NULL);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивТаблиц) Тогда
		Запрос.УстановитьПараметр("Таблицы",МассивТаблиц);
	Иначе
		Запрос.УстановитьПараметр("Таблицы",NULL);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Шаблон) Тогда
		Запрос.УстановитьПараметр("Шаблон",Шаблон);
	Иначе
		Запрос.УстановитьПараметр("Шаблон",NULL);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СформироватьЗначенияДанныхТаблицПредыдущегоОсмотра(МедКарта, ЗаполняемыйПрием, ДатаДокумента, ВерсииШаблонов, ШаблоныПриема) Экспорт
	
	Возврат РаботаСШаблонамиHTML.СформироватьЗначенияДанныхТаблицПредыдущегоОсмотра(МедКарта, ЗаполняемыйПрием, ДатаДокумента, ВерсииШаблонов, ШаблоныПриема);
	
КонецФункции

Процедура ЗаполнитьПоПредыдущимЗначениям(Форма) Экспорт
	
	Возврат
	
КонецПроцедуры

#КонецОбласти
